# text.py

# Курсы по направлениям и уровням
courses_data = {
    1: {
        1: ["HTML и CSS для начинающих - Основы веб-разработки", "Введение в JavaScript - Первый шаг в программирование"],
        2: ["JavaScript для продвинутых - Глубокое понимание языка", "React для продвинутых - Создание мощных приложений"],
        3: ["Полный курс по React - От начального до продвинутого уровня"]
    },
    2: {
        1: ["Основы анализа данных с Python - Начните карьеру аналитика данных"],
        2: ["Продвинутый анализ данных с R - Глубокие знания для профессионалов", "Основы машинного обучения - Первый шаг в ИИ"],
        3: ["Машинное обучение для экспертов - Продвинутые техники и методы"]
    },
    3: {
        1: ["Введение в машинное обучение - Основы ИИ для начинающих"],
        2: ["Глубокое обучение с TensorFlow - Разработка нейронных сетей"],
        3: ["Продвинутые техники машинного обучения - Инновационные методы и подходы"]
    }
}

directions = [
    {"title": "🖥️ <b>Веб-разработка</b>", "courses": courses_data[1]},
    {"title": "📊 <b>Анализ данных</b>", "courses": courses_data[2]},
    {"title": "🤖 <b>Машинное обучение</b>", "courses": courses_data[3]}
]

# Приветственное сообщение
def welcome_message(user_first_name):
    return (
        f"👋 Привет, {user_first_name}! Мы рады видеть вас в нашей онлайн школе EduSmart. 🎓\n"
        "Для начала вашего обучения, мы подготовили для вас бесплатный урок. 🚀\n"
        "📘 [https://www.youtube.com/watch?v=cgEdFIW5Z_g]"
    )

# Сообщение о курсах
def courses_message(direction_index):
    direction = directions[direction_index]
    courses_text = "\n".join([f"{i+1}. {course}" for i, course in enumerate(direction["courses"][1])])
    return (
        f"📚 <b>Наши курсы разделены на разные направления и уровни опыта:</b>\n\n"
        f"{direction['title']}\n{courses_text}\n\n"
        "Для получения подробной информации по каждому курсу, нажмите '✍️ Записаться на курс' и следуйте инструкциям."
    )

# Сообщение с отзывами
reviews = [
    "После прохождения этого курса я получила необходимые навыки и уверенность в своих силах, что помогло мне успешно пройти собеседование и получить работу своей мечты в крупной IT-компании. - Анна",
    "Учебные материалы на курсе были очень качественными и полезными, а преподаватели всегда готовы были помочь и ответить на все вопросы, благодаря чему я значительно улучшил свои навыки и понимание предмета. - Игорь",
    "Я настоятельно рекомендую EduSmart всем, кто стремится улучшить свои навыки. Курсы здесь помогли мне достичь новых высот в моей карьере, благодаря подробным урокам и поддержке опытных преподавателей. - Мария"
]

def review_message(review_index):
    review_text = reviews[review_index]
    return (
        f"⭐️ Отзывы наших студентов:\n{review_text}\n\n"
        "Хотите оставить свой отзыв? Напишите его нашему менеджеру @edusmartmanager, и мы добавим его сюда!"
    )

# Сообщение при записи на курс
def choose_level_message(direction):
    return (
        "Пожалуйста, выберите уровень:\n"
        f"{directions[direction-1]['title']}\n"
        "1. 👶 Для начинающих\n"
        "2. 📈 Для продвинутых\n"
        "3. 🏆 Для экспертов"
    )

# Сообщение при выборе курса
def choose_course_message(direction, level):
    courses = courses_data[direction][level]
    return (
        "Вот доступные курсы:\n" +
        "\n".join([f"{i+1}. {course}" for i, course in enumerate(courses)])
    )

# Сообщение при выборе курса и уведомление менеджера
def course_selected_message(selected_course):
    return f"🎉 Вы выбрали курс \"{selected_course}\". С вами свяжется менеджер для дальнейших инструкций."
